In [12]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [13]:
import webbrowser
website="https://en.wikipedia.org/wiki/NFL_win%E2%80%93loss_records"
webbrowser.open(website)

True

In [14]:
nflframe=pd.read_clipboard()
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [15]:
nflframe.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Total Games', 'Division'],
      dtype='object')

In [16]:
nflframe.Team

0          Dallas Cowboys
1       Green Bay Packers
2           Chicago Bears
3          Miami Dolphins
4    New England Patriots
Name: Team, dtype: object

In [17]:
nflframe['First NFL Season']

0    1960
1    1921
2    1920
3    1966
4    1960
Name: First NFL Season, dtype: int64

In [20]:
nflframe['First NFL Season']

0    1960
1    1921
2    1920
3    1966
4    1960
Name: First NFL Season, dtype: int64

In [29]:
DataFrame(nflframe,columns=['Team','First NFL Season','Total Games','Stadium'])

                   Team  First NFL Season Total Games  Stadium
0        Dallas Cowboys              1960         866      NaN
1     Green Bay Packers              1921       1,320      NaN
2         Chicago Bears              1920       1,354      NaN
3        Miami Dolphins              1966         784      NaN
4  New England Patriots              1960         868      NaN

In [24]:
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [25]:
nflframe.head(2)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North

In [26]:
nflframe.tail(2)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [28]:
# loc means index in python
nflframe.loc[3]

Rank                             4
Team                Miami Dolphins
Won                            439
Lost                           341
Tied                             4
Pct.                         0.563
First NFL Season              1966
Total Games                    784
Division                  AFC East
Name: 3, dtype: object

In [30]:
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [31]:
nflframe['Stadium']='Levi Stadium'

In [32]:
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levi Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levi Stadium
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levi Stadium
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levi Stadium
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levi Stadium

In [39]:
nflframe['Stadium']=np.arange(5)

In [40]:
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,0
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,1
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,2
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,3
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,4

In [41]:
stadium=Series(['Wembly Stadium','Old Trafford','Allianz Arena'],index=[3,2,1])
stadium

3    Wembly Stadium
2      Old Trafford
1     Allianz Arena
dtype: object

In [42]:
nflframe['Stadium']=stadium

In [43]:
nflframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,NaN
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Allianz Arena
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Old Trafford
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Wembly Stadium
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,NaN

In [44]:
data={'City':['KA','LHR','HYD'],'Population':[100000,50000,20000]}

In [45]:
DataFrame(data)

  City  Population
0   KA      100000
1  LHR       50000
2  HYD       20000

In [50]:
from numpy.random import randn

In [51]:
serie=Series([1,3,4,5],index=['A','B','C','D'])
serie

A    1
B    3
C    4
D    5
dtype: int64

In [53]:
serie[3]

5

In [58]:
ser2=serie.reindex(['A','B','C','D','E','F',],fill_value=0)

In [59]:
ser2

A    1
B    3
C    4
D    5
E    0
F    0
dtype: int64

In [60]:
ser3=Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [66]:
rangees=np.arange(15)
rangees

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [64]:
import random from randn

SyntaxError: invalid syntax (<ipython-input-64-675ef1cc87d6>, line 1)

In [68]:
ser3.reindex(rangees,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [69]:
dframe=DataFrame(randn(25).reshape(5,5),index=['A','B','C','D','E'],columns=['column1','column2','column3','column4','column5'])

In [70]:
dframe

    column1   column2   column3   column4   column5
A -0.506354  0.741169 -0.900262  1.073356  1.646349
B -1.179982  0.723832 -0.732208 -0.281866  1.909051
C  1.195371 -0.895939 -0.559826 -0.554583  0.950551
D -0.664206  1.052900  1.843098 -0.048102 -0.477313
E -1.888948 -1.370341 -2.058141  0.240868  0.334903

In [71]:
newcolumns=['col1','col2','col3','col4','col5','col6']
dframe.reindex(columns=newcolumns)

   col1  col2  col3  col4  col5  col6
A   NaN   NaN   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN   NaN   NaN
C   NaN   NaN   NaN   NaN   NaN   NaN
D   NaN   NaN   NaN   NaN   NaN   NaN
E   NaN   NaN   NaN   NaN   NaN   NaN

In [72]:
dframe

    column1   column2   column3   column4   column5
A -0.506354  0.741169 -0.900262  1.073356  1.646349
B -1.179982  0.723832 -0.732208 -0.281866  1.909051
C  1.195371 -0.895939 -0.559826 -0.554583  0.950551
D -0.664206  1.052900  1.843098 -0.048102 -0.477313
E -1.888948 -1.370341 -2.058141  0.240868  0.334903

In [76]:
dframe.ix[['A','B','C','D','E','F'],newcolumns]

   col1  col2  col3  col4  col5  col6
A   NaN   NaN   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN   NaN   NaN
C   NaN   NaN   NaN   NaN   NaN   NaN
D   NaN   NaN   NaN   NaN   NaN   NaN
E   NaN   NaN   NaN   NaN   NaN   NaN
F   NaN   NaN   NaN   NaN   NaN   NaN

In [79]:
d=DataFrame(columns=[1,3,5,6,3],index=['A','B','C','D','E'])

In [80]:
d

     1    3    5    6    3
A  NaN  NaN  NaN  NaN  NaN
B  NaN  NaN  NaN  NaN  NaN
C  NaN  NaN  NaN  NaN  NaN
D  NaN  NaN  NaN  NaN  NaN
E  NaN  NaN  NaN  NaN  NaN

In [85]:
# Drop Entry
ser1=Series(np.arange(3),index=['a','b','c'])

In [86]:
ser1

a    0
b    1
c    2
dtype: int32

In [87]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [88]:
dframe1=DataFrame(np.arange(9).reshape(3,3),index=['MT','ST','KT'],columns=['POP','SIZE','YEAR'])

In [89]:
dframe1

    POP  SIZE  YEAR
MT    0     1     2
ST    3     4     5
KT    6     7     8

In [92]:
C=dframe1.drop('MT',axis=0)

In [93]:
C

    POP  SIZE  YEAR
ST    3     4     5
KT    6     7     8

In [94]:
dframe1

    POP  SIZE  YEAR
MT    0     1     2
ST    3     4     5
KT    6     7     8